init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-26 Tue 12:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Testing title</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Marcin W" />
</head>
<body>
<div id="content">
<h1 class="title">Testing title</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgecf1708">1. Emacs Initial config</a>
<ul>
<li><a href="#org430ebc5">1.1. Initialiation defaults</a>
<ul>
<li><a href="#orgb02bc3f">1.1.1. Setting default coding system</a></li>
<li><a href="#org000d44a">1.1.2. Setting default display and editing options</a></li>
<li><a href="#org9ac8c96">1.1.3. Set the titlebar to the color of the theme</a></li>
<li><a href="#orgdefb47a">1.1.4. Setting title format</a></li>
<li><a href="#org60f0fac">1.1.5. Seting up package system and bootstrapping use-package</a></li>
<li><a href="#orgda900db">1.1.6. System specyfic defaults</a></li>
</ul>
</li>
<li><a href="#orgac205fa">1.2. Packages</a>
<ul>
<li><a href="#org2b2f627">1.2.1. Mac Only - initialize emacs with proper PATH</a></li>
<li><a href="#org2af5269">1.2.2. Load theme</a></li>
<li><a href="#org0cca340">1.2.3. Better defaults</a></li>
<li><a href="#orgcc4965d">1.2.4. Org Mode</a></li>
<li><a href="#org2ac0a08">1.2.5. Htmlize for org-mode</a></li>
<li><a href="#org92758e0">1.2.6. PDF Tools, exporting to pdf, etc</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgecf1708" class="outline-2">
<h2 id="orgecf1708"><span class="section-number-2">1</span> Emacs Initial config</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org430ebc5" class="outline-3">
<h3 id="org430ebc5"><span class="section-number-3">1.1</span> Initialiation defaults</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgb02bc3f" class="outline-4">
<h4 id="orgb02bc3f"><span class="section-number-4">1.1.1</span> Setting default coding system</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-language-environment <span style="color: #e2c770;">"UTF-8"</span>)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
</pre>
</div>
</div>
</div>

<div id="outline-container-org000d44a" class="outline-4">
<h4 id="org000d44a"><span class="section-number-4">1.1.2</span> Setting default display and editing options</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-default 'truncate-lines t)
(global-hl-line-mode 0)
(set-window-margins nil 2 2)
(electric-pair-mode 1)
(line-number-mode 0)
(column-number-mode 0)
(global-linum-mode 0)
(<span style="color: #fb2874;">setq</span> inhibit-splash-screen t
      inhibit-startup-message t
      pop-up-frames nil
      visible-bell 'top-bottom
      ring-bell-function 'ignore
      transient-mark-mode t
      show-paren-mode 1
      make-backup-files nil
      auto-save-default nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ac8c96" class="outline-4">
<h4 id="org9ac8c96"><span class="section-number-4">1.1.3</span> Set the titlebar to the color of the theme</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb2874;">when</span> (memq window-system '(mac ns))
  (add-to-list 'default-frame-alist '(ns-appearance . light))
  (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdefb47a" class="outline-4">
<h4 id="orgdefb47a"><span class="section-number-4">1.1.4</span> Setting title format</h4>
<div class="outline-text-4" id="text-1-1-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb2874;">setq</span> frame-title-format
  '(<span style="color: #e2c770;">"Emacs - "</span> (buffer-file-name <span style="color: #e2c770;">"%f"</span>
  ' (dired-directory dired-directory <span style="color: #e2c770;">"%b"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org60f0fac" class="outline-4">
<h4 id="org60f0fac"><span class="section-number-4">1.1.5</span> Seting up package system and bootstrapping use-package</h4>
<div class="outline-text-4" id="text-1-1-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb2874;">require</span> '<span style="color: #fd971f;">package</span>)

(add-to-list 'package-archives '(<span style="color: #e2c770;">"melpa"</span> . <span style="color: #e2c770;">"http://melpa.org/packages/"</span>))
(add-to-list 'package-archives '(<span style="color: #e2c770;">"org"</span> . <span style="color: #e2c770;">"https://orgmode.org/elpa/"</span>) t)

(<span style="color: #fb2874;">when</span> (&lt; emacs-major-version 24)
  (add-to-list 'package-archives
               '(<span style="color: #e2c770;">"gnu"</span> . <span style="color: #e2c770;">"http://elpa.gnu.org/packages/"</span>)))

(package-initialize)

(<span style="color: #fb2874;">unless</span> (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgda900db" class="outline-4">
<h4 id="orgda900db"><span class="section-number-4">1.1.6</span> System specyfic defaults</h4>
<div class="outline-text-4" id="text-1-1-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb2874;">when</span> (eq system-type 'darwin)
  (<span style="color: #fb2874;">defvar</span> <span style="color: #fd971f;">ls-lisp-use-insert-directory-program</span>)
  (<span style="color: #fb2874;">defvar</span> <span style="color: #fd971f;">powerline-image-apple-rgb</span>)
  (<span style="color: #fb2874;">setq</span> ns-use-srgb-colorspace t)
  (<span style="color: #fb2874;">setq</span> powerline-image-apple-rgb t)
  (<span style="color: #fb2874;">require</span> '<span style="color: #fd971f;">ls-lisp</span>)
  (<span style="color: #fb2874;">setq</span> ls-lisp-use-insert-directory-program nil))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgac205fa" class="outline-3">
<h3 id="orgac205fa"><span class="section-number-3">1.2</span> Packages</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org2b2f627" class="outline-4">
<h4 id="org2b2f627"><span class="section-number-4">1.2.1</span> Mac Only - initialize emacs with proper PATH</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb2874;">use-package</span> <span style="color: #fd971f;">exec-path-from-shell</span>
  <span style="color: #fd971f;">:if</span> (memq window-system '(mac ns))
  <span style="color: #fd971f;">:ensure</span> t
  <span style="color: #fd971f;">:config</span>
  (exec-path-from-shell-initialize)
  (exec-path-from-shell-copy-env <span style="color: #e2c770;">"GOPATH"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2af5269" class="outline-4">
<h4 id="org2af5269"><span class="section-number-4">1.2.2</span> Load theme</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb2874;">use-package</span> <span style="color: #fd971f;">doom-themes</span>
  <span style="color: #fd971f;">:ensure</span> t
  <span style="color: #fd971f;">:init</span>
  (load-theme 'doom-molokai t))
</pre>
</div>
</div>
</div>

<div id="outline-container-org0cca340" class="outline-4">
<h4 id="org0cca340"><span class="section-number-4">1.2.3</span> Better defaults</h4>
<div class="outline-text-4" id="text-1-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb2874;">use-package</span> <span style="color: #fd971f;">better-defaults</span>
  <span style="color: #fd971f;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcc4965d" class="outline-4">
<h4 id="orgcc4965d"><span class="section-number-4">1.2.4</span> Org Mode</h4>
<div class="outline-text-4" id="text-1-2-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb2874;">use-package</span> <span style="color: #fd971f;">org</span>
  <span style="color: #fd971f;">:ensure</span> org-plus-contrib)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2ac0a08" class="outline-4">
<h4 id="org2ac0a08"><span class="section-number-4">1.2.5</span> Htmlize for org-mode</h4>
<div class="outline-text-4" id="text-1-2-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb2874;">use-package</span> <span style="color: #fd971f;">htmlize</span>
  <span style="color: #fd971f;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org92758e0" class="outline-4">
<h4 id="org92758e0"><span class="section-number-4">1.2.6</span> PDF Tools, exporting to pdf, etc</h4>
<div class="outline-text-4" id="text-1-2-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb2874;">use-package</span> <span style="color: #fd971f;">pdf-tools</span>
  <span style="color: #fd971f;">:ensure</span> t
  <span style="color: #fd971f;">:config</span>
  (pdf-loader-install))
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Marcin W</p>
<p class="date">Created: 2019-02-26 Tue 12:58</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
